import Card from '@/components/Card'
import { NextPage } from 'next'
import { useRouter } from 'next/router'
import { MapIcon } from "@heroicons/react/24/outline"

const getMapConfig = (id: string) => {
  switch (id) {
    case 'sukhumvit':
      return {
        name: 'สายสุขุมวิท',
        description: 'สายสุขุมวิท หรือ รถไฟฟ้าสายสีเขียว (สุขุมวิท) มีเส้นทางการเดินรถรวมระยะทาง  68.25 กิโลเมตร รวม 60 สถานี เส้นทางเริ่มจาก เคหะสมุทรปราการ มาตามถนนสุขุมวิท ผ่านแยกบางนา เรื่อยมาจนถึง ถนนเพลินจิต ถนนพระรามที่1 ถนนพญาไท อนุสาวรีย์ชัยสมรภูมิ เข้าสู่ถนนพหลโยธิน สนามเป้า สะพานควาย ผ่านจตุจักร ห้าแยกลาดพร้าว แยกรัชโยธิน แยกเกษตรศาสตร์ วงเวียนหลักสี่ สะพานใหม่ แยกคปอ.ไปถึงคูคต เป็นการเดินทางเชื่อมต่อแบบไร้รอยต่อ และครอบคลุม 3 จังหวัด ได้แก่ จังหวัดปทุมธานี กรุงเทพมหานคร และจังหวัดสมุทรปราการ ทำให้สายสุขุมวิทมีระยะทาง รวมทั้งสิ้นประมาณ 54.25 กิโลเมตร มี 47 สถานี รวมสถานีร่วม (สถานีสยาม)',
        logo: '/images/สุขุมวิท.png',
        map: '/images/แผนที่สายสุขุมวิท.png',
      }
    case 'sri-lom':
      return {
        name: 'สายสีลม',
        description: 'มีระยะทางรวมทั้งสิ้นประมาณ 14 กิโลเมตร มี 14 สถานี รวมสถานีร่วม (สถานีสยาม) และสถานีเซนต์หลุยส์ เส้นทางเริ่มจากแยกถนนราชพฤกษ์ตัดกับถนนเพชรเกษม ไปตามถนนราชพฤกษ์ ผ่านแยกถนนราชพฤกษ์ตัดกับถนนวุฒากาศ ผ่านแยกรัชดา - ตลาดพลู ผ่านแยกตากสิน ข้ามแม่น้ำเจ้าพระยาที่สะพานตากสิน ไปตามถนนสาทร เลี้ยวซ้ายเข้าถนนช่องนนทรี ผ่านถนนสีลม สวนลุมพินี ถนนราชดำริ และเลี้ยวซ้ายเข้าถนนพระราม 1 ไปสิ้นสุดที่บริเวณหน้าสนามกีฬาแห่งชาติ ทำให้สายสีลมมีระยะทางรวมทั้งสิ้นประมาณ 14 กิโลเมตร มี 14 สถานี รวมสถานีร่วม (สถานีสยาม) และสถานีเซนต์หลุยส์',
        logo: '/images/สีลม.png',
        map: '/images/แผนที่สายสีลม.png',
      }
    case 'blue':
      return {
        name: 'สายสีน้ำเงิน',
        description: 'โครงการรถไฟฟ้ามหานคร สายเฉลิมรัชมงคล (สายสีน้ำเงิน) ระยะทาง 48 กิโลเมตร รวม 38 สถานี เส้นทางรถไฟฟ้า โครงการรถไฟฟ้าสายสีน้ำเงิน ระยะทางรวม 48 กม. 38 สถานี ประกอบไปด้วย - โครงการรถไฟฟ้ามหานคร สายเฉลิมรัชมงคล สถานีหัวลำโพง –สถานีบางซื่อ ระยะทาง 20 กิโลเมตร 18 สถานี - โครงการรถไฟฟ้าสายสีน้ำเงินส่วนต่อขยาย สถานีหัวลำโพง  -สถานีหลักสอง ระยะทาง 14 กิโลเมตร สถานีใต้ดิน 4 สถานี และสถานียกระดับ 7 สถานี รวม 11 สถานี และ สถานีบางซื่อ  -สถานีท่าพระ ระยะทาง 13 กิโลเมตร เป็นสถานียกระดับ 8 สถานี เวลาให้บริการ - ทุกวันไม่มีวันหยุด ตั้งแต่เวลา 06.00 - 24.00 น. - ความถี่ - ชั่วโมงเร่งด่วนเวลา 06.00 – 09.00 น. และ 16.30-19.30 น. ความถี่ไม่เกิน 5 นาทีต่อขบวน - ชั่วโมงปกติ ความถี่ไม่เกิน 10 นาทีต่อขบวน - จำนวนรถไฟฟ้า MRT วิ่งบริการสูงสุด XX ขบวน',
        logo: '/images/สีน้ำเงิน.png',
        map: '/images/แผนที่สายสีน้ำเงิน.png',
      }
    case 'airport-link':
      return {
        name: 'สายแอร์พอร์ท เรล ลิงก์',
        description: 'สายแอร์พอร์ตลิงค์ เปิดให้บริการเดินรถในแต่ละสถานีไม่เท่ากัน โดยเริ่มเดินรถขบวนแรกในเวลา 05.30 น. จากสถานีสุวรรณภูมิ และสถานีพญาไท โดยความถี่การเดินรถตามปกติอยู่ที่ 10-15 นาที และมีขบวนรถขบวนสุดท้ายให้บริการในเวลา 0.05 น. ก่อนปิดให้บริการในเวลา 0.30 น. ทั้งนี้ผู้โดยสารต้องใช้งานบัตรโดยสารให้ถูกประเภท ตั้งแต่เวลา 7.00 - 9.00 น. รถไฟฟ้าแอร์พอร์ต เรล ลิงก์ จะมีขบวนรถระยะสั้นให้บริการจากสถานีพญาไทจนถึงสถานีหัวหมาก ผู้ที่มากับขบวนรถระยะสั้นและต้องการเดินทางต่อไปยังสถานีบ้านทับช้าง สถานีลาดกระบัง และสถานีสุวรรณภูมิ จะต้องรอรถขบวนถัดไปที่สถานีหัวหมาก โดยใช้เวลารอขบวนถัดไป 10 นาที',
        logo: '/images/แอร์.png',
        map: '/images/แผนที่สายแอร์พอร์ต.png',
      }
    case 'purple':
      return {
        name: 'สายสีม่วง',
        description: 'รถไฟฟ้ามหานคร สายฉลองรัชธรรม มีเส้นทางการเดินรถรวมระยะทาง 23 กิโลเมตร เป็นระยะทางยกระดับทั้งหมด มีสถานีทั้งหมด 16 สถานี เริ่มจากบริเวณคลองบางไผ่ซึ่งเป็นที่ตั้งของศูนย์ซ่อมบำรุงรถไฟฟ้า ถนนวงแหวนรอบนอก (ตะวันตก) กาญจนาภิเษก เลี้ยวซ้ายเข้าสู่ถนนรัตนาธิเบศร์ ข้ามแม่น้ำเจ้าพระยาใกล้สะพานพระนั่งเกล้า ก่อนถึงสี่แยกแครายจะเลี้ยวขวาไปตามถนนติวานนท์ เลี้ยวซ้ายเข้าสู่ถนนกรุงเทพ - นนทบุรี ถึงบริเวณแยกเตาปูน มีสถานีเตาปูนเป็นสถานีเชื่อมต่อกับสายสีน้ำเงินส่วนต่อขยาย โดยสามารถเปลี่ยนเส้นทางจากสายสีม่วงไปสายสีน้ำเงินส่วนต่อขยายได้ที่สถานีเตาปูน',
        logo: '/images/สีม่วง.png',
        map: '/images/แผนที่สายสีม่วง.png',
      }
    case 'gold':
      return {
        name: 'สายสีทอง',
        description: 'โครงการรถไฟฟ้าสายสีทองหรือรถไฟฟ้าสายรอง สายสีทอง เป็นโครงการรถไฟฟ้าสายรองฝั่งธนบุรี รถไฟฟ้าสายสีทอง มีสถานีให้บริการ 3 สถานี คือ สถานีกรุงธนบุรี สถานีเจริญนคร (เชื่อมต่อกับไอคอนสยาม) และสถานีคลองสาน ใช้เวลา 6 นาที จากสถานีรถไฟฟ้า BTS กรุงธนบุรี มาถึงไอคอนสยาม แต่ละสถานีมีความสำคัญและเชื่อมต่อกับรถไฟฟ้าสายอื่นๆ โครงการระบบขนส่งมวลชนสายรองสายสีทอง',
        logo: '/images/สีทอง.png',
        map: '/images/แผนที่สายสีทอง.png',
      }
    case 'dark-red':
      return {
        name: 'สายสีแดงเข้ม',
        description: 'สายสีแดงเข้ม (ธรรมศาสตร์-มหาชัย) ระยะทาง 114.3 กิโลเมตร รวม 38 สถานี เป็นรถไฟฟ้าชานเมืองเชื่อมกรุงเทพฯ โซนเหนือและใต้ โดยเริ่มก่อสร้างเส้นทางบางซื่อ-รังสิต และบางซื่อ ตลิ่งชัน รวมระยะทางประมาณ 41 กิโลเมตร',
        logo: '/images/แดงเข้ม.png',
        map: '/images/แผนที่สายสีแดงเข้ม.png',
      }
    case 'light-red':
      return {
        name: 'สายสีแดงอ่อน',
        description: 'สายสีแดงอ่อน (ศาลายา - ตลิ่งชัน - บางซื่อ - มักกะสัน - หัวหมาก) รถไฟฟ้าสายสีแดงอ่อน หรือ รถไฟชานเมืองสายตะวันออก - ตะวันตก ส่วนหนึ่งของรถไฟฟ้าชานเมืองสีแดง ระยะทางประมาณ 127.5 กิโลเมตร ซึ่งส่วนใหญ่อยู่ในพื้นที่ ของการรถไฟแห่งประเทศไทย ขณะนี้อยู่ระหว่างการก่อสร้างบริเวณแยกตลิ่งชัน-สถานีกลางบางซื่อ',
        logo: '/images/แดงอ่อน.png',
        map: '/images/แผนที่สายสีแดงอ่อน.png',
      }
    case 'yellow':
      return {
        name: 'สายสีเหลือง',
        description: 'รถไฟฟ้าสายสีเหลืองเป็นรถไฟฟ้าโมโนเรลจำนวน 23 สถานี ระยะทาง 30.4 กิโลเมตร มีเส้นทางวิ่งจากลาดพร้าวไปสำโรง. สถานีรถไฟสายสีเหลือง 23 สถานี เชื่อมต่อเส้นทางกับระบบขนส่งสาธารณะอื่นๆ ในกรุงเทพฯ',
        logo: '/images/สีเหลือง.png',
        map: '/images/แผนที่สายสีเหลือง.png',
      }
    case 'pink':
      return {
        name: 'สายสีชมพู',
        description: 'รถไฟฟ้าสายสีชมพู หรือสายรามอินทรา ระยะทาง 34.5 กิโลเมตร,สำหรับเส้นทางรถไฟฟ้าทั้ง 30 สถานี จุดแรกเชื่อมต่อกับระบบรถไฟฟ้าสายสีม่วง รถไฟฟ้าสายสีน้ำตาล "สถานีศูนย์ราชการนนทบุรี" บริเวณแยกบางใหญ่-บางซื่อ และแคราย ต่อเนื่องไปตามเส้นทางถนนติวานนท์ ผ่าน 6 อำเภอ ระหว่างจังหวัดนนทบุรี และกรุงเทพฯ-มีนบุรี ปลายทาง "สถานีมีนบุรี" จุดเชื่อมต่อรถไฟฟ้าสายสีส้ม',
        logo: '/images/ชมพู.png',
        map: '/images/แผนที่สายสีชมพู.png',
      }
    case 'orange':
      return {
        name: 'สายสีส้ม',
        description: 'รถไฟฟ้าสายสีส้ม (บางขุนนนท์-ศูนย์วัฒนธรรมไทย-แยกร่มเกล้า) เป็นรถไฟฟ้ารางหนักที่เชื่อมระหว่างฝั่งตะวันออกและตะวันตกของกรุงเทพฯโดยมีจุดเริ่มต้นเส้นทางที่สถานีบางขุนนนท์ และสิ้นสุดที่สถานีแยกร่มเกล้า โครงการรถไฟฟ้าสายสีส้มตะวันออก บริเวณจุดตัดรามคำแหง-สุวินทวงศ์ เชื่อมต่อรถไฟฟ้าอีก 3 สาย ได้แก่ สถานีศูนย์วัฒนธรรมแห่งประเทศไทย เชื่อมต่อรถไฟฟ้าสายสีน้ำเงิน สถานีแยกลำสาลี เชื่อมต่อรถไฟฟ้าสายสีเหลือง สถานีมีนบุรี เชื่อมต่อรถไฟฟ้าสายสีชมพู',
        logo: '/images/สีส้ม.png',
        map: '/images/แผนที่สายสีส้ม.png',
      }
    default:
      return null
  }
}

const MapPage: NextPage = () => {
  const router = useRouter()
  const { id } = router.query

  if (typeof id !== 'string') return null

  const map = getMapConfig(id)

  if (!map) return null

  return (
    <div className="flex flex-col items-center justify-center w-full ">
      <div className="flex flex-col items-center">
        <div className="flex gap-1 w-full justify-center">
          <MapIcon className="h-14 w-14 text-red-500 " />
          <span className="text-black text-2xl m-3">แผนที่{map.name}</span>
        </div>
        <img src="/Line.png" alt="line" />
      </div>
      <div>
        <div className='flex w-full justify-center'>
          <div className='flex w-3/4 items-center'>
            <div>
              <div className='flex items-center gap-3 text-lg'>
                <img src={map.logo} alt="" className="w-24 h-24 object-contain" />
                {map.name}
              </div>
              <div className='flex flex-col gap-2'>
                <h1 className="text-gray-700">
                  {map.description}
                </h1>
                <div className='flex w-full justify-center'>
                  <img src={map.map} alt={map.name} className="flex max-w-4xl rounded-lg" />
                </div>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
  )
}

export default MapPage